app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `karyawan`
SELECT COUNT(*) AS `numrows` FROM `kriteria`
---
    public function index()
    {
        $uri = service('uri');

        // Instance model KaryawanModel
        $karyawanModel = new KaryawanModel();

        // Hitung jumlah data karyawan
        $totalKaryawan = $karyawanModel->countAll(); // Menghitung total karyawan

        // Instance model KriteriaModel
        $kriteriaModel = new KriteriaModel();

        // Hitung jumlah data kriteria
        $totalKriteria = $kriteriaModel->countAll(); // Menghitung total kriteria