app/Controllers/DataKaryawan.php

SELECT *
FROM `karyawan`
---
    public function index()
    {
        try {
            $karyawanModel = new KaryawanModel();
            $data['karyawan'] = $karyawanModel->findAll();