app/Controllers/Hasil.php

SELECT *
FROM `kriteria`
SELECT `penilaian_karyawan`.*, `karyawan`.`name`, `sk1`.`keterangan` as `k1_ket`, `sk2`.`keterangan` as `k2_ket`, `sk3`.`keterangan` as `k3_ket`, `sk4`.`keterangan` as `k4_ket`, `sk5`.`keterangan` as `k5_ket`
FROM `penilaian_karyawan`
JOIN `karyawan` ON `karyawan`.`id` = `penilaian_karyawan`.`karyawan_id`
LEFT JOIN `sub_kriteria` as `sk1` ON `sk1`.`nilai` = `penilaian_karyawan`.`k1` AND `sk1`.`kriteria_id` = 1
LEFT JOIN `sub_kriteria` as `sk2` ON `sk2`.`nilai` = `penilaian_karyawan`.`k2` AND `sk2`.`kriteria_id` = 2
LEFT JOIN `sub_kriteria` as `sk3` ON `sk3`.`nilai` = `penilaian_karyawan`.`k3` AND `sk3`.`kriteria_id` = 3
LEFT JOIN `sub_kriteria` as `sk4` ON `sk4`.`nilai` = `penilaian_karyawan`.`k4` AND `sk4`.`kriteria_id` = 4
LEFT JOIN `sub_kriteria` as `sk5` ON `sk5`.`nilai` = `penilaian_karyawan`.`k5` AND `sk5`.`kriteria_id` = 5
SELECT *
FROM `karyawan`
ORDER BY `name` ASC
---
    public function index()
    {
        $uri = service('uri');

        $PenilaianKaryawanM = new PenilaianKaryawanM();
        $karyawanModel = new KaryawanModel();
        $subkriteriaModel = new SubKriteriaM();
        $kriteriaModel = new KriteriaModel();

        $kriteria = $kriteriaModel->findAll();

        $builder = $PenilaianKaryawanM
            ->select('penilaian_karyawan.*, karyawan.name')
            ->join('karyawan', 'karyawan.id = penilaian_karyawan.karyawan_id');

        foreach ($kriteria as $index => $k) {
            $alias = 'sk' . ($index + 1);
            $column = 'k' . ($index + 1);
            $builder = $builder->join("sub_kriteria as $alias", "$alias.nilai = penilaian_karyawan.$column AND $alias.kriteria_id = {$k['id']}", 'left')
                ->select("$alias.keterangan as {$column}_ket");
        }

        $data['penilaian_karyawan'] = $builder->findAll();
        $data['karyawan'] = $karyawanModel->orderBy('name', 'ASC')->findAll();