app/Controllers/KriteriaPenilaian.php

    public function index()
    {
        $uri = service('uri');
        $model = new KriteriaModel();
        $data['kriteria'] = $model->findAll();
---
SELECT *
FROM `kriteria`