app/Controllers/PenilaianKaryawan.php

    public function index()
    {
        $uri = service('uri');

        $PenilaianKaryawanM = new PenilaianKaryawanM();
        $karyawanModel = new KaryawanModel();
        $subkriteriaModel = new SubKriteriaM();
        $kriteriaModel = new KriteriaModel();

        $data['penilaian_karyawan'] = $PenilaianKaryawanM
            ->select('penilaian_karyawan.*, karyawan.name')
            ->join('karyawan', 'karyawan.id = penilaian_karyawan.karyawan_id')
            ->findAll();

        $data['karyawan'] = $karyawanModel->orderBy('name', 'ASC')->findAll();
        $data['sub_kriteria'] = $subkriteriaModel->ambilNamaAndKodeDariKriteria();
        $data['kriteria'] = $kriteriaModel->findAll();
---
SELECT `penilaian_karyawan`.*, `karyawan`.`name`
FROM `penilaian_karyawan`
JOIN `karyawan` ON `karyawan`.`id` = `penilaian_karyawan`.`karyawan_id`
SELECT *
FROM `karyawan`
ORDER BY `name` ASC
SELECT `penilaian_karyawan`.*, `karyawan`.`name`, `sk1`.`keterangan` as `k1_ket`, `sk2`.`keterangan` as `k2_ket`, `sk3`.`keterangan` as `k3_ket`, `sk4`.`keterangan` as `k4_ket`, `sk5`.`keterangan` as `k5_ket`
FROM `penilaian_karyawan`
JOIN `karyawan` ON `karyawan`.`id` = `penilaian_karyawan`.`karyawan_id`
LEFT JOIN `sub_kriteria` as `sk1` ON `sk1`.`nilai` = `penilaian_karyawan`.`k1`
LEFT JOIN `sub_kriteria` as `sk2` ON `sk2`.`nilai` = `penilaian_karyawan`.`k2`
LEFT JOIN `sub_kriteria` as `sk3` ON `sk3`.`nilai` = `penilaian_karyawan`.`k3`
LEFT JOIN `sub_kriteria` as `sk4` ON `sk4`.`nilai` = `penilaian_karyawan`.`k4`
LEFT JOIN `sub_kriteria` as `sk5` ON `sk5`.`nilai` = `penilaian_karyawan`.`k5`
SELECT *
FROM `kriteria`

    public function store()
    {
        $PenilaianKaryawanM = new PenilaianKaryawanM();

        $data = [
            'karyawan_id' => $this->request->getPost('karyawan_id'),
            'k1' => $this->request->getPost('sub_kriteria[K1]') ?? null,
            'k2' => $this->request->getPost('sub_kriteria[K2]') ?? null,
            'k3' => $this->request->getPost('sub_kriteria[K3]') ?? null,
            'k4' => $this->request->getPost('sub_kriteria[K4]') ?? null,
            'k5' => $this->request->getPost('sub_kriteria[K5]') ?? null,
        ];

        $PenilaianKaryawanM->save($data);
---
INSERT INTO `penilaian_karyawan` (`karyawan_id`, `k1`, `k2`, `k3`, `k4`, `k5`, `created_at`, `updated_at`) VALUES ('2', '5', '5', '5', '5', '5', '2024-06-14 10:22:27', '2024-06-14 10:22:27')