app/Controllers/SubKriteria.php

    public function index()
    {
        $uri = service('uri');
        $SubKriteriaM = new SubKriteriaM();
        $data['sub_kriteria'] = $SubKriteriaM->select('sub_kriteria.*, kriteria.nama_kriteria')
        ->join('kriteria', 'kriteria.id = sub_kriteria.kriteria_id')
        ->findAll();

        $kriteria = new KriteriaModel();
        $data['kriteria'] = $kriteria->findAll();
---
SELECT `sub_kriteria`.*, `kriteria`.`nama_kriteria`
FROM `sub_kriteria`
JOIN `kriteria` ON `kriteria`.`id` = `sub_kriteria`.`kriteria_id`
SELECT *
FROM `kriteria`