app/Models/PenilaianKaryawanM.php

    public function getPenilaianKaryawan()
    {
        return $this->db->table('penilaian_karyawan')
        ->select('penilaian_karyawan.*, karyawan.name, sk1.keterangan as k1_ket, sk2.keterangan as k2_ket, sk3.keterangan as k3_ket, sk4.keterangan as k4_ket, sk5.keterangan as k5_ket')
        ->join('karyawan', 'karyawan.id = penilaian_karyawan.karyawan_id')
        ->join('sub_kriteria as sk1', 'sk1.nilai = penilaian_karyawan.k1')
        ->join('sub_kriteria as sk2', 'sk2.nilai = penilaian_karyawan.k2')
        ->join('sub_kriteria as sk3', 'sk3.nilai = penilaian_karyawan.k3')
        ->join('sub_kriteria as sk4', 'sk4.nilai = penilaian_karyawan.k4')
        ->join('sub_kriteria as sk5', 'sk5.nilai = penilaian_karyawan.k5')
        ->get()
            ->getResultArray();
---
SELECT `penilaian_karyawan`.*, `karyawan`.`name`, `sk1`.`keterangan` as `k1_ket`, `sk2`.`keterangan` as `k2_ket`, `sk3`.`keterangan` as `k3_ket`, `sk4`.`keterangan` as `k4_ket`, `sk5`.`keterangan` as `k5_ket`
FROM `penilaian_karyawan`
JOIN `karyawan` ON `karyawan`.`id` = `penilaian_karyawan`.`karyawan_id`
JOIN `sub_kriteria` as `sk1` ON `sk1`.`nilai` = `penilaian_karyawan`.`k1`
JOIN `sub_kriteria` as `sk2` ON `sk2`.`nilai` = `penilaian_karyawan`.`k2`
JOIN `sub_kriteria` as `sk3` ON `sk3`.`nilai` = `penilaian_karyawan`.`k3`
JOIN `sub_kriteria` as `sk4` ON `sk4`.`nilai` = `penilaian_karyawan`.`k4`
JOIN `sub_kriteria` as `sk5` ON `sk5`.`nilai` = `penilaian_karyawan`.`k5`