app/Models/SubKriteriaM.php

    public function ambilNamaAndKodeDariKriteria()
    {
        return $this->select('sub_kriteria.*, kriteria.nama_kriteria, kriteria.kode_kriteria')
            ->join('kriteria', 'kriteria.id = sub_kriteria.kriteria_id')
            ->findAll();
---
SELECT `sub_kriteria`.*, `kriteria`.`nama_kriteria`, `kriteria`.`kode_kriteria`
FROM `sub_kriteria`
JOIN `kriteria` ON `kriteria`.`id` = `sub_kriteria`.`kriteria_id`