app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function getUser($userId)
    {
        // Ambil data pengguna berdasarkan ID
        return $this->find($userId);